MESSAGE_HELLO = '''Привет! Это наш бот с шпаргалками 🤫😅
Используй /menu для выбора школьного предмета
'''
MESSAGE_MENU = '''
    Выбери пункт меню ⬇️⬇️⬇️
'''
MESSAGE_CHOICE_SUBJECT_ERROR = '''Вы неверно выбрали предмет
Выберите один из пунктов меню или "Отмена" ⬇️⬇️⬇️
'''
MESSAGE_CHOICE = '''Вы выбрали модуль {choice}, тема: {topic}
В следующем сообщении введите два и более слов для поиска
Если слов несколько вводите их через пробел (Запятые не нужны)
'''
MESSAGE_CANCEL = '''Для продолжения работы введите /menu'''

MESSAGE_INFO = '''*Информация про бота*'''

MESSAGE_404 = '''*Ничего не нашёл:((((*'''

MESSAGE_200 = '''Вот что я нашёл по заданным словам: '''

MESSAGE_ERROR_TWO = '''*Нужно два слова*'''

ERROR_1001 = '''*В вашем доме замечено ещё одно активное устройство. Если вы один, немедленно звоните в 911*'''