MESSAGE_HELLO = '''Привет! Это наш бот с шпаргалками 🤫😅
С помощью команды /info ты можешь познакомиться с функционалом бота 👌
Используй /menu для выбора школьного предмета
'''
MESSAGE_MENU = '''
    Выбери предмет с которым нужна помощь ⬇️⬇️⬇️
'''
MESSAGE_CHOICE_SUBJECT_ERROR='''Вы неверно выбрали предмет
Выбери предмет из списка ⬇️⬇️⬇️
'''
MESSAGE_CHOICE='''Вы выбрали модуль {choice}, тема: {topic}.
В следующем сообщении введите два или более слов для поиска
Если слов несколько вводите их через пробел (Запятые не нужны)
'''
MESSAGE_CANCEL='''Для продолжения работы введите /menu'''

MESSAGE_INFO='''Это бот, предназначенный для помощи в поиске и изучении школьных предметов. Вы можете использовать различные команды для навигации и доступа к широкому спектру материалов по алгебре, геометрии, физике и другим предметам. \n\nИспользуйте команду /menu для выбора предмета, а затем следуйте инструкциям бота для получения информации по интересующей теме. \n\nВведите /cancel для того чтобы в любой момент перейти к выбору списку предметов. \n\nЕсли ты используешь web-версию, то когда бот тебе предложит выбрать предмет или тему, нужно будет самостоятельно открыть меню с выбором предмета. Оно располагается рядом с кнопкой отправить.\n\nПриятного использования 😊 \n\nP.S. На данный момент работает поиск только по Алгебре, но уже скоро будет доступен выбор и других предметов 😊'''

MESSAGE_ALWAYS = '''Если нужна моя помощь, то воспользуйся командами из меню 😉'''

MESSAGE_404='''К сожалению по твоему запросу ничего найдено не было, но в следующем обновлении мы обязательно добавим инетресующие тебя темы 👌''' 
MESSAGE_403='''Для точного ответа на интересующий тебя вопрос нужно ввести 2 слова.\nПопробуй ещё раз, я уверен у тебя всё получиться 😉''' 
MESSAGE_200='''Вот что я нашёл по заданным словам:'''



MESSAGE_ERROR_TWO = '''Для точного ответа на интересующий тебя вопрос нужно ввести 2 слова.\nПопробуй ещё раз, я уверен у тебя всё получиться 😉'''  
 
ERROR_1001 = '''*В вашем доме замечено ещё одно активное устройство. Если вы один, немедленно звоните в 911*''' 
 
CANCEL_ID = '''Id создателя не дам🤐🤫''' 
 
MESSAGE_ALWAYS_CAME_BACK = '''Пожалуйста не засоряйте переписку🥺. Пользуйся командами.''' 
 
BYE_BYE = '''Fire in the hole!'''